app/views/users/show.html.erb

SELECT `posts`.* FROM `posts`  WHERE `posts`.`user_id` = 2
---
<div class="row">
	<%@user.posts.each do |post|%>