app/controllers/follows_controller.rb

  def create
    friend = User.find_by_name(params['friend_name'])
    if friend
      Follow.create(user: current_user, friend: friend)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`name` = 'teste' LIMIT 1
INSERT INTO `follows` (`friend_id`, `user_id`) VALUES (1, 2)